1s/ERP/Conf/Documents/Лико_ПеремещениеПаллета2_0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ПеремещениеПаллета2_0</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_ПаллетыВСекциях</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ПеремещениеПаллета2_0/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 
 
 #Область ПрограммныйИнтерфейс
 
 Функция СоздатьПеремещение( Паллет, Адрес) Экспорт
	 УстановитьПривилегированныйРежим(Истина);  
	 
	 // Создаем новый документ
	 НовыйДокумент = СоздатьДокумент();
	 
	 // Заполняем документ согласно стандартам 1С
	 НовыйДокумент.Заполнить(Неопределено);
	 
	 // Устанавливаем реквизиты
	 НовыйДокумент.Дата 			= ТекущаяДатаСеанса();
	 НовыйДокумент.Паллет 			= Паллет;
	 НовыйДокумент.АдресХранения 	= Адрес;
	 
	 // Сохранение документа с обработкой ошибок
	 Попытка
		 НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	 Исключение
		 ОшибкаСообщение = "Ошибка при сохранении документа Лико_ПеремещениеПаллета2_0: " + ОписаниеОшибки();
		 ВызватьИсключение ОшибкаСообщение;
	 КонецПопытки;
	 
	 Возврат НовыйДокумент.Ссылка;
	 
 КонецФункции
 
 #КонецОбласти
 
 #Область СлужебныйПрограммныйИнтерфейс
 
 // Код процедур и функций 
 
 #КонецОбласти
 
 #Область СлужебныеПроцедурыИФункции
 
 // Код процедур и функций
 
 #КонецОбласти

 #КонецЕсли
